Gtat/msp430-examples/components/comm/SPI/main.c
#include <msp430.h> 

/*
 * main.c
 *//* --COPYRIGHT--,BSD_EX
 * Copyright (c) 2012, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 *******************************************************************************
 *
 *                       MSP430 CODE EXAMPLE DISCLAIMER
 *
 * MSP430 code examples are self-contained low-level programs that typically
 * demonstrate a single peripheral function or device feature in a highly
 * concise manner. For this the code may rely on the device's power-on default
 * register values and settings such as the clock configuration and care must
 * be taken when combining code from several examples to avoid potential side
 * effects. Also see www.ti.com/grace for a GUI- and www.ti.com/msp430ware
 * for an API functional library-approach to peripheral configuration.
 *
 * --/COPYRIGHT--*/
//******************************************************************************
//   MSP430G2xx3 Demo - USCI_A0, SPI 3-Wire Master Incremented Data
//
//   Description: SPI master talks to SPI slave using 3-wire mode. Incrementing
//   data is sent by the master starting at 0x01. Received data is expected to
//   be same as the previous transmission.  USCI RX ISR is used to handle
//   communication with the CPU, normally in LPM0. If high, P1.0 indicates
//   valid data reception.
//   ACLK = n/a, MCLK = SMCLK = DCO ~1.2MHz, BRCLK = SMCLK/2
//
//   Use with SPI Slave Data Echo code example. If slave is in debug mode, P3.6
//   slave reset signal conflicts with slave's JTAG; to work around, use IAR's
//   "Release JTAG on Go" on slave device.  If breakpoints are set in
//   slave RX ISR, master must stopped also to avoid overrunning slave
//   RXBUF.
//
//                    MSP430G2xx3
//                 -----------------
//             /|\|              XIN|-
//              | |                 |
//              --|RST          XOUT|-
//                |                 |
//                |             P1.2|-> Data Out (UCA0SIMO)
//                |                 |
//          LED <-|P1.0         P1.1|<- Data In (UCA0SOMI)
//                |                 |
//  		LOAD<-|P1.5         P1.4|-> Serial Clock Out (UCA0CLK)
//
//
//   D. Dang
//   Texas Instruments Inc.
//   February 2011
//   Built with CCS Version 4.2.0 and IAR Embedded Workbench Version: 5.10
//******************************************************************************
#include <msp430.h>
#include <msp430g2553.h>

unsigned char MST_Data, SLV_Data;

int main(void)
{
  volatile unsigned int i;

  WDTCTL = WDTPW + WDTHOLD;                 // Stop watchdog timer
  P1OUT = 0xFF;                             // P1 setup for LED & reset output
  P1DIR |= BIT0 + BIT5;                     //
  P1SEL = BIT1 + BIT2 + BIT4;
  P1SEL2 = BIT1 + BIT2 + BIT4;
//  P1DIR |= BIT0;                 //
//  P1SEL = BIT1 + BIT2 + BIT4 + BIT5;
//  P1SEL2 = BIT1 + BIT2 + BIT4 + BIT5;
//  UCA0CTL0 |= UCCKPH + UCMSB + UCMST + UCSYNC;  // 3-pin, 8-bit SPI master
  UCA0CTL0 |=UCMSB + UCMST + UCSYNC;  // 3-pin, 8-bit SPI master, capture data on falling CLK edge
//  UCA0CTL0 |= UCCKPH + UCMSB + UCMST + UCSYNC+UCMODE_2;  // 4-pin, 8-bit SPI master
  UCA0CTL1 |= UCSSEL_2;                     // SMCLK
  UCA0BR0 |= 0x06;                          // /2
  UCA0BR1 = 0;                              //
  UCA0MCTL = 0;                             // No modulation
  //////////////////////

  //USICNT |= BIT6;

  ////////////////////


  UCA0CTL1 &= ~UCSWRST;                     // **Initialize USCI state machine**
  IE2 |= UCA0TXIE;                          // Enable USCI0 RX interrupt



//  P1OUT &= ~BIT5;                           // Now with SPI signals initialized,
  P1OUT |= BIT5;                            //set P1.5 to 1
//  __delay_cycles(5);
//////////////////////////////////////////////////
//  P1OUT &= ~BIT5;    //set P1.5 to 1
  __delay_cycles(10);                 // Wait for slave to initialize

  MST_Data = 0x01;                          // Initialize data values
//  SLV_Data = 0x00;

UCA0TXBUF = MST_Data;


__bis_SR_register(LPM0_bits + GIE);       // CPU off, enable interrupts
 //MST_Data = 0x10;                          // Initialize data values
 //UCA0TXBUF = MST_Data;                     // Transmit first character

 // __bis_SR_register(LPM0_bits + GIE);       // CPU off, enable interrupts
}

// Test for valid RX and TX character
#pragma vector=USCIAB0TX_VECTOR
__interrupt void USCIA0TX_ISR(void)
{
 // volatile unsigned int i;

  //while (!(IFG2 & UCA0TXIFG));              // USCI_A0 TX buffer ready?
  //if (!(IFG2 & UCA0TXIFG));
  //if (UCA0RXBUF == SLV_Data)                // Test for correct character RX'd
  //  P1OUT |= BIT0;                          // If correct, light LED
 // else
  //  P1OUT &= ~BIT0;                         // If incorrect, clear LED

  while (!(IFG2 & UCA0TXIFG));
  MST_Data=0x80;						//Data bits D7~D0.
  UCA0TXBUF = MST_Data;
   while (!(IFG2 & UCA0TXIFG));
   __delay_cycles(40); //

   P1OUT |= BIT5;
   P1OUT &= ~BIT5; // load data to DAC output latch by set P1.5 to 0.
   __delay_cycles(100);

  ////////////////////////////////

   P1OUT |= BIT5;  // end data load. prepare for next SPI transmission.
   __delay_cycles(10); //

// MST_Data = 0x00;                          // Initialize data values

//  UCA0TXBUF = MST_Data;
                     // Add time between transmissions to
  // make sure slave can keep up
  IE2 &= ~(UCA0TXIE);
}

